a='\033[1mЗнищене Королівство'
a1=a.center(70)
print(a1)
lucar = 0
rozbinuk = 10
print("Ти лицар, що має знайти знищене королівсто короля Ральфа 2 та з'ясувати чому воно знищене")
k1=input('Зараз ти знаходишcя у себе в селещі. Обери що робити.\n1-піти на ринок та придбати знаряддя для походу.2-піти без знаряддя.3-Завершити гру.\n')
if k1 =='1':
    print('Ти отримав зброю та знаряддя, так тримати :)')
    lucar += 15
    k3 = input('Зараз ти знаходишся на роздоріжжі\nКуди ти підеш?\n1-на право.2-на ліво.3-прямо.\n')
    if k3 == '1':
        print('Ти потрапив у пастку...\nНа жаль ти помер.\n\033[1mGAME OVER')
    elif k3 == '2':
        print('Ти увійшов у зачарований ліс де на тебе напали розбійники')
        if lucar > rozbinuk:
            print('Ти вбив розбійників зброєю. Та спокійно знайшов королівсто.\nПрибувши до знищеного королівста ти взнав, що король Ральф 2 спалив його через чуму.')
            print('\033[1mGAME OVER')
        elif lucar < rozbinuk:
            print('Ти не придбав зброю тому ти не можеш вбити розбійників.\n GAME OVER')
    elif k3 == '3':
        print('Там гора.\nТи не можеш її подолати.')
        print('\033[1mGAME OVER')
elif k1 =='2':
    print('Ти не маєш зброї, але можеш швидко іти :)')
    lucar = 0
    k2=input('Зараз ти знаходишся на роздоріжжі\nКуди ти підеш?\n1-на право.2-на ліво.3-прямо.\n')
    if k2 =='1':
        print('Ти потрапив у пастку...\nНа жаль ти помер.\n\033[1mGAME OVER')
    elif k2 =='2':
        print('Ти увійшов у зачарований ліс де на тебе напали розбійники')
        if lucar > rozbinuk:
             print('Ти вбив розбійників зброєю або врукопашну. Та спокійно знайшов королівсто.\nПрибувши до знищеного королівста ти взнав, що король Ральф 2 спалив його через чуму.')
             print('\033[1mGAME OVER')
        elif lucar < rozbinuk:
            print('Ти не придбав зброю тому ти не можеш вбити розбійників.\n GAME OVER')
    elif k2 =='3':
        print('Там гора.\nТи не можеш її подолати.')
        print('\033[1mGAME OVER')
elif k1 =='3' :
    print('\033[1mGAME OVER')
b='\033[1mЗнищене Королівство 2'
b1=b.center(70)
print(b1)
lucar1 = 0
MCH = 30
drakon = 50
orel = 8
print('Ти все ще лицар, який досі не врятував прекрасну принцесу.\nТож  у другій часті гри ми пропонуємо тобі вирішити це питання.')
k4=input('Прибувши до свого селища ти взанаєш від старчого,\nщо десь за трьома морями та двома горами\nв заточенні Дракона жде прекрасного лицаря принцеса Фіона.\nТож обери підеш ти спасати чи ні.\n1-так.2-ні.\n')
if k4 == '1':
    print('Ти дуже відважний, що вирішив врятувати принцесу. Не кожен на це здатний.')
    k5=input("Обери шлях.\n1-через море.2-через гори.\n")
    if k5 == '1':
        print('Доведеться боротися з Морським Чудовиськом.')
        k6=input('Перед цим обери чи візьмеш ти додкове спорядження.1-так.2-ні.\n')
        if k6 == '1':
            print('Це чудово!')
            lucar1 += 35
            print('Ти успішно подолав страшного Морського Чудовиська, так тримати.\nТа не забувай, що попереду Дракон.')
            k7=input('Ти успішно пересік море.\nЗараз ти натрапив на чарівника.\nВ нього можна придбати:\n1-щит+5.2-кращі обладунки+20')
            if k7 == '1':
                print('На привеликий жаль ти не зміг здолати Дракона.\nТому тобі довелося повернутися важко пораненим до свого селища.\nТа назавжди забути про лицарство.')
            elif k7 == '2':
                print('Так!! Ти зміг здолати Дракона та врятувати прекрасну принцесу Фіону.\nКоли ви разом повернулися до твого селища, принцеса прийняла ваше прохання взяти\nїї руку і серце. Невдовзі ви одружились.')
                print('HAPPY END\nGAME OVER')
        elif k6 == '2':
            print('Дуже прикро, що ти загинув в бою з Морським Чудовиськом...')
            print('\033[1mGAME OVER')
    elif k5 == '2':
        lucar1 +=10
        print('Чудово, що ти обрав гори. Та все ж Могутній Орел зустрівся на твому шляху.\nНа щастя ти вситг полагодити своє знаряддя\nта подолати Могутнього Орла.')
        k8 = input('Ти успішно пересік гори.\nЗараз ти натрапив на чарівника.\n В нього можна придбати:1-щит+5.2-кращі обладунки+20')
        if k8== '1':
            print('На привеликий жаль ти не зміг здолати Дракона.\n Тому тобі довелося повернутися важко пораненим до свого селища.\nТа назавжди забути про лицарство.')
        elif k8 == '2':
            print('Так!! Ти зміг здолати Дракона та врятувати прекрасну принцесу Фіону.\nКоли ви разом повернулися до твого селища, принцеса прийняла ваше прохання взяти\nїї руку і серце. Невдовзі ви одружились.')
            print('HAPPY END\nGAME OVER')

elif k4 == '2':
    print('Прикро, що ти так легко здався...\nGAME OVER')