print('Вітаємо в словнику іспанської мови!')
k={"Яблуко": 'manzana', 'Банан':"plátano",'Дім':"inicio",'Картопля':"patata",'Сестра':"Hermana",'Брат':"Hermano"}
o=input('Оберіть, що ви хочите зробити: 1-знайти слово.2-додати слово.\n')
if o == '1':
    p=input("Введіть слово, яке ви хочите знайти:\n").title()
    print(f"Переклад:\n{k.get(p)}")
elif o == '2':
    v=input("Введіть слово, яке ви хочите додати українською:\n").title()
    v1=input("Введіть переклад цього слова на іспанській:\n")
    k1=k.update({v:v1})
    print(f"Нове слово {v}додано!\n")
else:
    print("\033[31mERROR\033[0m")