#початок, список, запит користувачача
print('ФІЛЬМИ')
l=['Крик','Володар перстнів','Моя провина','У джунглях']
a=input('Введіть, що ви хочите зробити:1-додати фільм ,2-видалити фільм ,3-переглянути список фільми\n')

#виконання запиту
if a=='1':
    x=input('Введіть назву нового фільма:\n')

    l.append(f'{x}')
    print(l)
elif a=='2':
    print(l)
    b=input('Введіть фільм, який ви хочите видалити:\n')
    l.remove(b)
    print(l)
elif a=='3':
    print(l)
else:
    print('ПОМИЛКА, спробуйте ще :)')
